<details><summary>Digger run report at 2024-08-05 12:22:30 (UTC)</summary>
              <details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_argo has been locked by PR #13
</details>

<details><summary>Plan for <b>anzeha/floorball-fantasy-infra#staging_argo</b></summary>
  
```terraform
Terraform will perform the following actions:

  # helm_release.argo_apps[0] will be created
  + resource "helm_release" "argo_apps" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-apps"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                    - name: floorball-fantasy
                      namespace: argocd
                      additionalAnnotations: 
                        argocd-image-updater.argoproj.io/image-list: users_ms=anzeha/ffantasy.users,game_domain_ms=anzeha/ffantasy.game_domain,game_logic_ms=anzeha/ffantasy.game_logic
                        argocd-image-updater.argoproj.io/users_ms.update-strategy: latest
                        argocd-image-updater.argoproj.io/game_domain_ms.update-strategy: latest
                        argocd-image-updater.argoproj.io/game_logic_ms.update-strategy: latest
                        argocd-image-updater.argoproj.io/git-branch: main
                        argocd-image-updater.argoproj.io/write-back-method: git:secret:argocd/repo-deploy-key
                        argocd-image-updater.argoproj.io/users_ms.force-update: "true"
                        argocd-image-updater.argoproj.io/game_domain_ms.force-update: "true"
                        argocd-image-updater.argoproj.io/game_logic_ms.force-update: "true"
                      destination:
                        namespace: floorball-fantasy
                        server: https://kubernetes.default.svc
                      project: default
                      source:
                        path: k8s
                        repoURL: https://github.com/anzeha/floorball-fantasy-deployment.git
                        targetRevision: main
                        directory:
                          recurse: false
                          jsonnet: {}
                      syncPolicy:
                        automated:
                          selfHeal: true
                          prune: true
                projects: []
                applicationsets: []
                extensions: []
            EOT,
        ]
      + verify                     = false
      + version                    = "0.0.8"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.argo_image_updater[0] will be created
  + resource "helm_release" "argo_image_updater" {
      + atomic                     = false
      + chart                      = "argocd-image-updater"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-image-updater"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # -- Replica count for the deployment. It is not advised to run more than one replica.
                replicaCount: 1
                image:
                  # -- Default image repository
                  repository: quay.io/argoprojlabs/argocd-image-updater
                  # -- Default image pull policy
                  pullPolicy: Always
                  # -- Overrides the image tag whose default is the chart appVersion
                  tag: ""
                
                # -- The deployment strategy to use to replace existing pods with new ones
                updateStrategy:
                  type: Recreate
                # -- ImagePullSecrets for the image updater deployment
                imagePullSecrets: []
                # -- Global name (argocd-image-updater.name in _helpers.tpl) override
                nameOverride: ""
                # -- Global fullname (argocd-image-updater.fullname in _helpers.tpl) override
                fullnameOverride: ""
                # -- Global namespace (argocd-image-updater.namespace in _helpers.tpl) override
                namespaceOverride: ""
                
                # -- Extra arguments for argocd-image-updater not defined in `config.argocd`.
                # If a flag contains both key and value, they need to be split to a new entry
                extraArgs: []
                  # - --disable-kubernetes
                  # - --dry-run
                  # - --health-port
                  # - 8080
                  # - --interval
                  # - 2m
                  # - --kubeconfig
                  # - ~/.kube/config
                  # - --match-application-name
                  # - staging-*
                  # - --max-concurrency
                  # - 5
                  # - --once
                  # - --registries-conf-path
                  # - /app/config/registries.conf
                
                # -- Extra environment variables for argocd-image-updater
                extraEnv: []
                  # - name: AWS_REGION
                  #   value: "us-west-1"
                
                # -- Extra envFrom to pass to argocd-image-updater
                extraEnvFrom: []
                  # - configMapRef:
                  #     name: config-map-name
                  # - secretRef:
                  #     name: secret-name
                
                # -- Extra K8s manifests to deploy for argocd-image-updater
                ## Note: Supports use of custom Helm templates
                extraObjects: []
                  # - apiVersion: secrets-store.csi.x-k8s.io/v1
                  #   kind: SecretProviderClass
                  #   metadata:
                  #     name: argocd-image-updater-secrets-store
                  #   spec:
                  #     provider: aws
                  #     parameters:
                  #       objects: |
                  #         - objectName: "argocd-image-updater"
                  #           objectType: "secretsmanager"
                  #           jmesPath:
                  #               - path: "client_id"
                  #                 objectAlias: "client_id"
                  #               - path: "client_secret"
                  #                 objectAlias: "client_secret"
                  #     secretObjects:
                  #     - data:
                  #       - key: client_id
                  #         objectName: client_id
                  #       - key: client_secret
                  #         objectName: client_secret
                  #       secretName: argocd-image-updater-secrets-store
                  #       type: Opaque
                  #       labels:
                  #         app.kubernetes.io/part-of: argocd
                
                # -- Init containers to add to the image updater pod
                initContainers: []
                  #  - name: download-tools
                  #    image: alpine:3.8
                  #    command: [sh, -c]
                  #    args:
                  #      - wget -qO- https://get.helm.sh/helm-v2.16.1-linux-amd64.tar.gz | tar -xvzf - &&
                  #        mv linux-amd64/helm /custom-tools/
                  #    volumeMounts:
                  #      - mountPath: /custom-tools
                  #        name: custom-tools
                
                # -- Additional volumeMounts to the image updater main container
                volumeMounts: []
                
                # -- Additional volumes to the image updater pod
                volumes: []
                  ## Use init containers to configure custom tooling
                  ## https://argo-cd.readthedocs.io/en/stable/operator-manual/custom_tools/
                  ## When using the volumes & volumeMounts section bellow, please comment out those above.
                  #  - name: custom-tools
                  #    emptyDir: {}
                
                config:
                  # -- API kind that is used to manage Argo CD applications (`kubernetes` or `argocd`)
                  applicationsAPIKind: "kubernetes"
                
                  # Described in detail here https://argocd-image-updater.readthedocs.io/en/stable/install/reference/#flags
                  # Note: this is only relevant if config.applicationsAPIKind == 'argocd'
                  argocd:
                    # -- Use the gRPC-web protocol to connect to the Argo CD API
                    grpcWeb: true
                    # -- Connect to the Argo CD API server at server address
                    serverAddress: ""
                    # -- If specified, the certificate of the Argo CD API server is not verified.
                    insecure: false
                    # -- If specified, use an unencrypted HTTP connection to the Argo CD API instead of TLS.
                    plaintext: false
                    # -- If specified, the secret with Argo CD API key will be created.
                    token: ""
                
                  # -- Disable kubernetes events
                  disableKubeEvents: false
                
                  # -- Username to use for Git commits
                  gitCommitUser: ""
                
                  # -- E-Mail address to use for Git commits
                  gitCommitMail: ""
                
                  # -- Changing the Git commit message
                  gitCommitTemplate: ""
                
                  # -- Argo CD Image Update log level
                  logLevel: "debug"
                
                  # -- Argo CD Image Updater registries list configuration. More information [here](https://argocd-image-updater.readthedocs.io/en/stable/configuration/registries/)
                  registries: 
                    - name: Docker Hub
                      prefix: docker.io
                      api_url: https://registry-1.docker.io
                      ping: yes
                    # - name: Google Container Registry
                    #   api_url: https://gcr.io
                    #   prefix: gcr.io
                    #   ping: no
                    #   credentials: pullsecret:foo/bar
                    # - name: RedHat Quay
                    #   api_url: https://quay.io
                    #   ping: no
                    #   prefix: quay.io
                    #   credentials: env:REGISTRY_SECRET
                    # - name: ECR
                    #   api_url: https://123456789.dkr.ecr.eu-west-1.amazonaws.com
                    #   prefix: 123456789.dkr.ecr.eu-west-1.amazonaws.com
                    #   ping: yes
                    #   insecure: no
                    #   credentials: ext:/scripts/auth1.sh
                    #   credsexpire: 10h
                
                  # -- Argo CD Image Updater ssh client parameter configuration.
                  sshConfig:
                    {}
                    #  config: |
                    #    Host *
                    #          PubkeyAcceptedAlgorithms +ssh-rsa
                    #          HostkeyAlgorithms +ssh-rsa
                
                # whether to mount authentication scripts, if enabled, the authentication scripts will be mounted on /scripts that can be used to authenticate with registries (ECR)
                # refer to https://argocd-image-updater.readthedocs.io/en/stable/configuration/registries/#specifying-credentials-for-accessing-container-registries for more info
                authScripts:
                  # -- Whether to mount the defined scripts that can be used to authenticate with a registry, the scripts will be mounted at `/scripts`
                  enabled: false
                  # -- Map of key-value pairs where the key consists of the name of the script and the value the contents
                  scripts: {}
                    # auth1.sh: |
                    #   #!/bin/sh
                    #   echo "auth script 1 here"
                    # auth2.sh: |
                    #   #!/bin/sh
                    #   echo "auth script 2 here"
                
                serviceAccount:
                  # -- Specifies whether a service account should be created
                  create: true
                  # -- Annotations to add to the service account
                  annotations: {}
                  # -- Labels to add to the service account
                  labels: {}
                  # -- The name of the service account to use.
                  # If not set and create is true, a name is generated using the fullname template
                  name: ""
                
                # -- Pod Annotations for the deployment
                podAnnotations: {}
                
                # -- Pod Labels for the deployment
                podLabels: {}
                
                # -- Pod security context settings for the deployment
                podSecurityContext: {}
                  # fsGroup: 2000
                
                # -- Security context settings for the deployment
                # @default -- See [values.yaml]
                securityContext:
                  allowPrivilegeEscalation: false
                  capabilities:
                    drop:
                      - ALL
                  readOnlyRootFilesystem: true
                  runAsNonRoot: true
                  seccompProfile:
                    type: RuntimeDefault
                
                rbac:
                  # -- Enable RBAC creation
                  enabled: true
                
                # -- Pod memory and cpu resource settings for the deployment
                resources: {}
                
                # -- Kubernetes nodeSelector settings for the deployment
                nodeSelector: {}
                
                # -- Kubernetes toleration settings for the deployment
                tolerations: []
                
                # -- Kubernetes affinity settings for the deployment
                affinity: {}
                
                # Metrics configuration
                metrics:
                  # -- Deploy metrics service
                  enabled: false
                  service:
                    # -- Metrics service annotations
                    annotations: {}
                    # -- Metrics service labels
                    labels: {}
                    # -- Metrics service port
                    servicePort: 8081
                  serviceMonitor:
                    # -- Enable a prometheus ServiceMonitor
                    enabled: false
                    # -- Prometheus ServiceMonitor interval
                    interval: 30s
                    # -- Prometheus [RelabelConfigs] to apply to samples before scraping
                    relabelings: []
                    # -- Prometheus [MetricRelabelConfigs] to apply to samples before ingestion
                    metricRelabelings: []
                    # -- Prometheus ServiceMonitor selector
                    selector: {}
                      # promtheus: kube-prometheus
                
                    # -- Prometheus ServiceMonitor namespace
                    namespace: ""
                    # -- Prometheus ServiceMonitor labels
                    additionalLabels: {}
            EOT,
        ]
      + verify                     = false
      + version                    = "0.11.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_secret_v1.git_creds[0] will be created
  + resource "kubernetes_secret_v1" "git_creds" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "repo-deploy-key"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

  ```
</details>


<details><summary>Terraform plan validation check (staging_argo)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_cluster has been locked by PR #13
</details>


→ No changes in terraform output for anzeha/floorball-fantasy-infra#staging_cluster


<details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_kubernetes-addons has been locked by PR #13
</details>


→ No changes in terraform output for anzeha/floorball-fantasy-infra#staging_kubernetes-addons

</details>